---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ValueAtPointBase..::..SetFlags Method
ValueAtPointBase Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetFlags(IList<(Of <<'(Int32>)>>)) | Independently sets the flags associated to all measurements. |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |

# See Also

ValueAtPointBase Class

ValueAtPointBase Members

Autodesk.Revit.DB Namespace